/*
? Напишіть функцію getRectArea(sideA, sideB) для обчислення площі прямокутника.
? Сторони прямокутника будуть переденні до параметрів sideA та sideB.
*/

/*
 ? Напиши функцію calcBMI(weight, height) яка розраховує та повертає індекс
 ? маси тіла людини. Для цього необхідно розділити вагу на
 ? квадрат висоти.
 ?
 ? Вага та висота будуть спеціально передані як рядки. Не цілі числа можуть
 ? бути задані у вигляді 24.7 або 24,7, тобто як роздільник дробової
 ? частини може бути кома.
 ?
 ? Індекс маси тіла необхідно округлити до однієї цифри після коми.
 */

//  Напишіть функцію convertTemperature, яка приймає три параметри: temperature, fromUnit і toUnit. 
// Функція повинна конвертувати температуру з одиниці fromUnit в одиницю toUnit.
// Одиниці температури можуть бути "C" для Цельсія, "F" для Фаренгейта або "K" для Кельвіна.
// Зауважте, що температура може бути передана як рядок або число. 
// Поверніть результат округлений до двох знаків після коми. 

// Напишіть функцію checkUserChoice, яка приймає один параметр choice - це рядок, 
// що представляє вибір користувача.Функція повинна перевірити вибір користувача і 
// повернути рядок з повідомленням про результат. 
// Наприклад, якщо choice рівний "rock", "paper" або "scissors", поверніть рядок "Valid choice". 
// В іншому випадку поверніть рядок "Invalid choice".

// Напишіть функцію compareNumbers, яка приймає два параметри a і b. 
// Функція повинна порівняти ці числа і повернути одне з трьох повідомлень: "a > b", "a < b" або "a === b".
// Не забудьте перевірити типи даних, щоб уникнути непередбачуваних результатів порівняння.
// Спробуйте створити функції для цих задач і перевірити їх коректність. 
// Це допоможе вам отримати практику з умовними операторами та роботою зі строками та числами в JavaScript.