/*
? Напишіть функцію getRectArea(sideA, sideB) для обчислення площі прямокутника.
? Сторони прямокутника будуть переденні до параметрів sideA та sideB.
*/

/*
 ? Напиши функцію calcBMI(weight, height) яка розраховує та повертає індекс
 ? маси тіла людини. Для цього необхідно розділити вагу на
 ? квадрат висоти.
 ?
 ? Вага та висота будуть спеціально передані як рядки. Не цілі числа можуть
 ? бути задані у вигляді 24.7 або 24,7, тобто як роздільник дробової
 ? частини може бути кома.
 ?
 ? Індекс маси тіла необхідно округлити до однієї цифри після коми.
 */